ИнКар.АвтоСервисМагазин/src/Catalogs/АСМ_Поколения/АСМ_Поколения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АСМ_Поколения</name>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.АСМ_Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.АСМ_Модели</types>
    </type>
  </attributes>
</mdclass:Catalog>

ИнКар.АвтоСервисМагазин/src/Catalogs/АСМ_Модификации/АСМ_Модификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АСМ_Модификации</name>
  <attributes>
    <name>ГодНачалаВыпуска</name>
    <type>
      <types>CatalogRef.АСМ_Годы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодОкончанияВыпуска</name>
    <type>
      <types>CatalogRef.АСМ_Годы</types>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.АСМ_Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.АСМ_Модели</types>
    </type>
  </attributes>
  <attributes>
    <name>Поколение</name>
    <type>
      <types>CatalogRef.АСМ_Поколения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТоплива</name>
    <type>
      <types>CatalogRef.АСМ_ТипыТоплива</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПривода</name>
    <type>
      <types>CatalogRef.АСМ_ТипыПривода</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТрансмиссии</name>
    <type>
      <types>CatalogRef.АСМ_ТипыТрансмиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>Мощность</name>
    <type>
      <types>CatalogRef.АСМ_Мощности</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийОбъем</name>
    <type>
      <types>CatalogRef.АСМ_Объемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКузова</name>
    <type>
      <types>CatalogRef.АСМ_ТипыКузовов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДверей</name>
    <type>
      <types>CatalogRef.АСМ_КоличествоДверей</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектации</name>
    <attributes>
      <name>Комплектация</name>
      <type>
        <types>CatalogRef.АСМ_Комплектации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИнКар.АвтоСервисМагазин/src/CommonModules/АСМ_КаталогВызовСервера/Module.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область ПрограммныйИнтерфейс

Процедура ОбновитьКаталог(ПараметрыОбновления, URIКаталога = "http://autoload.avito.ru/format/Autocatalog.xml") Экспорт

	Счетчики = ИнициализироватьСтруктуруСчетчиков();

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ИмяСобытия", НСтр("ru='КаталогАвтомобилей.ИзменениеЭлементаКаталога'"));

	// Оповещение о прогрессе
	ТекстСообщения = "Получение каталога из Интернета...";
	ДлительныеОперации.СообщитьПрогресс(, ТекстСообщения);

	ЗаписыватьОшибку = Истина;
	ПараметрыПолучения = ПолучениеФайловИзИнтернетаКлиентСервер.ПараметрыПолученияФайла();
	ПараметрыПолучения.ПутьДляСохранения = ПолучитьИмяВременногоФайла("xml");

	Результат = ПолучениеФайловИзИнтернета.СкачатьФайлНаСервере(URIКаталога, ПараметрыПолучения, ЗаписыватьОшибку);

	Если Результат.Статус = Ложь Тогда
		Возврат;
	КонецЕсли;

	// Оповещение о прогрессе
	ТекстСообщения = "Проверка каталога...";
	ДлительныеОперации.СообщитьПрогресс(, ТекстСообщения);

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(Результат.Путь);

	ОбработанныйXML = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);

	Марки = ОбработанныйXML.Make;

	Если ТипЗнч(Марки) = Тип("СписокXDTO") Тогда
		Для Каждого Марка Из Марки Цикл
			ОбработкаМарки(Марка, ДанныеЗаполнения, Счетчики);
		КонецЦикла;
	Иначе
		ОбработкаМарки(Марки, ДанныеЗаполнения, Счетчики);
	КонецЕсли;

КонецПроцедуры


// Находит элемент справочника по коду и наименованию.
// 
// Если отсутствует элемент справочника с заданным кодом и ИзменятьЭлемент = Истина - создает новый элемент
// Если наименование не соответствует заданному и ИзменятьЭлемент = Истина - производит переименование элемента
// 
// В случае неудачного поиска, создания или переименования элемента возвращает Неопределено
// 
// Параметры:
//  СправочникМенеджер - СправочникМенеджер - Справочник менеджер
//  Код - Строка - Код
//  Наименование - Строка - Наименование
//  ИмяСобытия - Строка - Имя события для журнала регистрации
//  ИзменятьЭлемент - Булево - Разрешить изменять и создавать элементы
//  СчетчикИзмененных - Число,Неопределено - Счетчик измененных элементов
// 
// Возвращаемое значение:
//  Неопределено, Произвольный - Найти создать по коду и наименованию
Функция НайтиСоздатьПоКодуИНаименованию(СправочникМенеджер,
										ДанныеЗаполнения,
										ИзменятьЭлемент,
										СчетчикИзмененных = Неопределено) Экспорт

	// Получение имени справочника для изменения текста запроса

	ПустаяСсылка = СправочникМенеджер.ПустаяСсылка();
	ИмяСправочника = ПустаяСсылка.Метаданные().ПолноеИмя();
	
	// Проверка типа аргумента на необходимость и возможность инкремента
	СчетчикИспользуется = ТипЗнч(СчетчикИзмененных) = Тип("Число");

	// Инициализация запроса
	Запрос = ЗапросПоКоду(ИмяСправочника, ДанныеЗаполнения.Код, ДанныеЗаполнения.Наименование);

	НайденЭлемент = Запрос.Выполнить().Выбрать();

	Если НайденЭлемент.Следующий() Тогда

		Если НайденЭлемент.НаименованиеСоответствует Тогда
			// Возврат найденной ссылки
			ИскомаяСсылка = НайденЭлемент.Ссылка;
		ИначеЕсли ИзменятьЭлемент Тогда 
			// Переименование элемента
			ЭлементОбъект = НайденЭлемент.Ссылка.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(ЭлементОбъект, ДанныеЗаполнения);

			Попытка
			
				// Запись измененного бъекта
				ЭлементОбъект.Записать();
			
				// Возврат найденной ссылки
				ИскомаяСсылка = ЭлементОбъект.Ссылка;
			
				// Инкремент счетчика измененных элементов
				Если СчетчикИспользуется Тогда
					СчетчикИзмененных = СчетчикИзмененных + 1;
				КонецЕсли;

			Исключение
				// Возврат Неопределено
				ИскомаяСсылка = Неопределено;
			
				// Запись ошибки в журнал регистрации
				РасшифровкаОшибкиВЖурналРегистрации(ДанныеЗаполнения.ИмяСобытия);

			КонецПопытки;

		Иначе
			// Возврат Неопределено
			ИскомаяСсылка = ПустаяСсылка;
		КонецЕсли;

	Иначе
		// Создание нового элемента справочника
		Элемент = СправочникМенеджер.СоздатьЭлемент();
		Элемент.Заполнить(ДанныеЗаполнения);

		Попытка	
			
			// Запись нового элемента					
			Элемент.Записать();
			
			// Возврат новой ссылки
			ИскомаяСсылка = Элемент.Ссылка;
			
			// Инкремент счетчика измененных элементов
			Если СчетчикИспользуется Тогда
				СчетчикИзмененных = СчетчикИзмененных + 1;
			КонецЕсли;

		Исключение					
			
			// Возврат Неопределено
			ИскомаяСсылка = ПустаяСсылка;

			// Запись ошибки в журнал регистрации
			РасшифровкаОшибкиВЖурналРегистрации(ДанныеЗаполнения.ИмяСобытия);

		КонецПопытки;

	КонецЕсли;

	Возврат ИскомаяСсылка

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область XML

Функция ТекстИзXML(Узел) Экспорт

	Последовательность = Узел.Последовательность();
	ТекстовоеЗначение = Последовательность.ПолучитьТекст(0);

	Возврат ТекстовоеЗначение;

КонецФункции

Процедура ПолучитьЗначениеТэга(СправочникМенеджер, ДанныеЗаполнения, ИмяРеквизита, Тэг)

	КодИНаименование = Новый Структура;
	КодИНаименование.Вставить("Код", Тэг.id);
	КодИНаименование.Вставить("Наименование", ТекстИзXML(Тэг));

	Ссылка = АСМ_КаталогВызовСервера.НайтиСоздатьПоКодуИНаименованию(СправочникМенеджер, КодИНаименование, Истина);
	ДанныеЗаполнения.Вставить(ИмяРеквизита, Ссылка);

КонецПроцедуры

#КонецОбласти

// Возвращает структуру счетчиков измененных при загрузке файла элементов
// 
// Возвращаемое значение:
//  Структура - Структура счетчиков:
// * Марки - Число - Счетчик марок
// * Модели - Число - Счетчик моделей
// * Поколения - Число - Счетчик поколений
// * Модификации - Число - Счетчик модификаций
// * Комплектации - Число - Счетчик комплектаций
Функция ИнициализироватьСтруктуруСчетчиков()

	Перем Счетчики;

	Счетчики = Новый Структура;
	Счетчики.Вставить("Марки", 0);
	Счетчики.Вставить("Модели", 0);
	Счетчики.Вставить("Поколения", 0);
	Счетчики.Вставить("Модификации", 0);
	Счетчики.Вставить("Комплектации", 0);

	Возврат Счетчики

КонецФункции
Процедура ОбработкаМарки(Марка, ДанныеЗаполнения, Счетчики)

	ДанныеЗаполнения.Вставить("Код", Марка.id);
	ДанныеЗаполнения.Вставить("Наименование", Марка.name);

	СправочникМенеджер = Справочники.АСМ_Марки;

	МаркаСсылка = АСМ_КаталогВызовСервера.НайтиСоздатьПоКодуИНаименованию(СправочникМенеджер,
																		  ДанныеЗаполнения,
																		  Истина,
																		  Счетчики.Марки);
	ДанныеЗаполнения.Вставить("Марка", МаркаСсылка);

	Модели = Марка.Model;

	Если ТипЗнч(Модели) = Тип("СписокXDTO") Тогда
		Для Каждого Модель Из Модели Цикл
			ОбработкаМодели(Модель, ДанныеЗаполнения, Счетчики);
		КонецЦикла;
	Иначе
		ОбработкаМодели(Модели, ДанныеЗаполнения, Счетчики);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаМодели(Модель, ДанныеЗаполнения, Счетчики)

	ДанныеЗаполнения.Вставить("Код", Модель.id);
	ДанныеЗаполнения.Вставить("Наименование", Модель.name);

	СправочникМенеджер = Справочники.АСМ_Модели;

	МодельСсылка = АСМ_КаталогВызовСервера.НайтиСоздатьПоКодуИНаименованию(СправочникМенеджер,
																		   ДанныеЗаполнения,
																		   Истина,
																		   Счетчики.Модели);
	ДанныеЗаполнения.Вставить("Модель", МодельСсылка);

	Поколения = Модель.Generation;

	Если ТипЗнч(Поколения) = Тип("СписокXDTO") Тогда
		Для Каждого Поколение Из Поколения Цикл
			ОбработкаПоколения(Поколение, ДанныеЗаполнения, Счетчики);
		КонецЦикла;
	Иначе
		ОбработкаПоколения(Поколения, ДанныеЗаполнения, Счетчики);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПоколения(Поколение, ДанныеЗаполнения, Счетчики)

	ДанныеЗаполнения.Вставить("Код", Поколение.id);
	ДанныеЗаполнения.Вставить("Наименование", Поколение.name);

	СправочникМенеджер = Справочники.АСМ_Поколения;

	ПоколениеСсылка = АСМ_КаталогВызовСервера.НайтиСоздатьПоКодуИНаименованию(СправочникМенеджер,
																			  ДанныеЗаполнения,
																			  Истина,
																			  Счетчики.Поколения);
	ДанныеЗаполнения.Вставить("Поколение", ПоколениеСсылка);

	// Оповещение о прогрессе
	ТекстСообщения = СтрШаблон("%1 %2 %3", ДанныеЗаполнения.Марка, ДанныеЗаполнения.Модель, ДанныеЗаполнения.Поколение);
	ДлительныеОперации.СообщитьПрогресс(, ТекстСообщения);

	Модификации = Поколение.Modification;

	Если ТипЗнч(Модификации) = Тип("СписокXDTO") Тогда
		Для Каждого Модификация Из Модификации Цикл
			ОбработкаМодификации(Модификация, ДанныеЗаполнения, Счетчики);
		КонецЦикла;
	Иначе
		ОбработкаМодификации(Модификации, ДанныеЗаполнения, Счетчики);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаМодификации(Модификация, ДанныеЗаполнения, Счетчики)

	ДанныеЗаполнения.Вставить("Код", Модификация.id);
	ДанныеЗаполнения.Вставить("Наименование", Модификация.name);
	
	// Годы выпуска
	СправочникМенеджер = Справочники.АСМ_Годы;

	КодИНаименование = Новый Структура;
	КодИНаименование.Вставить("Код", Модификация.YearFrom.id);
	КодИНаименование.Вставить("Наименование", ТекстИзXML(Модификация.YearFrom));

	ГодНачалаВыпуска = АСМ_КаталогВызовСервера.НайтиСоздатьПоКодуИНаименованию(СправочникМенеджер,
																			   КодИНаименование,
																			   Истина);
	КодИНаименование.Вставить("Код", Модификация.YearTo.id);
	КодИНаименование.Вставить("Наименование", ТекстИзXML(Модификация.YearTo));

	ГодОкончанияВыпуска = АСМ_КаталогВызовСервера.НайтиСоздатьПоКодуИНаименованию(СправочникМенеджер,
																				  КодИНаименование,
																				  Истина);
	ДанныеЗаполнения.Вставить("ГодНачалаВыпуска", ГодНачалаВыпуска);
	ДанныеЗаполнения.Вставить("ГодОкончанияВыпуска", ГодОкончанияВыпуска);
	
	// Основные характеристики транспортного средства
	ПолучитьЗначениеТэга(Справочники.АСМ_ТипыТоплива, ДанныеЗаполнения, "ТипТоплива", Модификация.FuelType);
	ПолучитьЗначениеТэга(Справочники.АСМ_ТипыПривода, ДанныеЗаполнения, "ТипПривода", Модификация.DriveType);
	ПолучитьЗначениеТэга(Справочники.АСМ_ТипыТрансмиссии, ДанныеЗаполнения, "ТипТрансмиссии", Модификация.Transmission);
	ПолучитьЗначениеТэга(Справочники.АСМ_Мощности, ДанныеЗаполнения, "Мощность", Модификация.Power);
	ПолучитьЗначениеТэга(Справочники.АСМ_Объемы, ДанныеЗаполнения, "РабочийОбъем", Модификация.EngineSize);
	ПолучитьЗначениеТэга(Справочники.АСМ_ТипыКузовов, ДанныеЗаполнения, "ТипКузова", Модификация.BodyType);
	ПолучитьЗначениеТэга(Справочники.АСМ_КоличествоДверей, ДанныеЗаполнения, "КоличествоДверей", Модификация.Doors);

	СправочникМенеджер = Справочники.АСМ_Модификации;

	МодификацияСсылка = АСМ_КаталогВызовСервера.НайтиСоздатьПоКодуИНаименованию(СправочникМенеджер,
																				ДанныеЗаполнения,
																				Истина,
																				Счетчики.Поколения);
	ДанныеЗаполнения.Вставить("Модификация", МодификацияСсылка);

	// Добавляем комплектации
	Комплектации = Модификация.Complectations;

	МодификацияОбъект = МодификацияСсылка.ПолучитьОбъект();
	ТЧКомплектации = МодификацияОбъект.Комплектации;
	ТЧКомплектации.Очистить();

	Если ТипЗнч(Комплектации) = Тип("СписокXDTO") Тогда
		Для Каждого Комплектация Из Комплектации Цикл
			ОбработкаКомплектации(Комплектация, ДанныеЗаполнения, Счетчики, ТЧКомплектации);
		КонецЦикла;
	ИначеЕсли ТипЗнч(Комплектации.Complectation) = Тип("СписокXDTO") Тогда
		Для Каждого Элемент Из Комплектации.Complectation Цикл
		ОбработкаКомплектации(Элемент, ДанныеЗаполнения, Счетчики, ТЧКомплектации);
			КонецЦикла;
	Иначе
		ОбработкаКомплектации(Комплектации.Complectation, ДанныеЗаполнения, Счетчики, ТЧКомплектации);
	КонецЕсли;

	Попытка
		МодификацияОбъект.Записать();
	Исключение
		РасшифровкаОшибкиВЖурналРегистрации(ДанныеЗаполнения.ИмяСобытия);
	КонецПопытки;

КонецПроцедуры

Процедура ОбработкаКомплектации(Комплектация, ДанныеЗаполнения, Счетчики, ТЧКомплектации)

	Перем КомплСсылка;
	Перем НовыйЭлемент;

	ДанныеЗаполнения.Вставить("Код", Комплектация.id);
	ДанныеЗаполнения.Вставить("Наименование", Комплектация.name);

	СправочникМенеджер = Справочники.АСМ_Комплектации;

	КомплСсылка = АСМ_КаталогВызовСервера.НайтиСоздатьПоКодуИНаименованию(СправочникМенеджер,
																		  ДанныеЗаполнения,
																		  Истина,
																		  Счетчики.Комплектации);

	НовыйЭлемент = ТЧКомплектации.Добавить();
	НовыйЭлемент.Комплектация = КомплСсылка;

КонецПроцедуры


// Инициализация запроса для метода НайтиСоздатьПоКодуИНаименованию 
// 
// Параметры:
//  ИмяСправочника - Строка - Имя справочника
//  Код - Строка - Код искомого элемента
//  Наименование - Строка - Наименование искомого элемента
// 
// Возвращаемое значение:
//  Запрос - Запрос по коду
Функция ЗапросПоКоду(ИмяСправочника, Код, Наименование)

	ТекстЗапроса = "ВЫБРАТЬ
				   |	Справочник.Ссылка КАК Ссылка,
				   |	ВЫБОР
				   |		КОГДА Справочник.Наименование = &Наименование
				   |			ТОГДА ИСТИНА
				   |		ИНАЧЕ ЛОЖЬ
				   |	КОНЕЦ КАК НаименованиеСоответствует
				   |ИЗ
				   |	&ИмяСправочника КАК Справочник
				   |ГДЕ
				   |	Справочник.Код = &Код";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяСправочника", ИмяСправочника);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("ИмяСправочника", ИмяСправочника);
	Запрос.Текст = ТекстЗапроса;

	Возврат Запрос;

КонецФункции

// Заносит описание ошибки в журнал регистрации с уровнем "Ошибка"
// 
// Параметры:
//  ИмяСобытия - Строка - Имя события в журнале регистрации
Процедура РасшифровкаОшибкиВЖурналРегистрации(ИмяСобытия) Экспорт

	Комментарий = ОписаниеОшибки();
	Уровень = УровеньЖурналаРегистрации.Ошибка;
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень,,, Комментарий);

КонецПроцедуры

#КонецОбласти
